In [2]:
import pandas as pd

## Q1: Create a Series with indexes = 1, 2, 3 and has three names.

In [3]:
s = pd.Series({1:'first',2:'sec',3:'third'})
s

1    first
2      sec
3    third
dtype: object

## Q2: Change indexes to 11, 12, 13.

In [4]:
s.index = [11, 12, 13]
s

11    first
12      sec
13    third
dtype: object

## Q3: Retrieve First and second elements.

In [16]:

print(s[0:2])

11    first
12      sec
dtype: object

## Q4: Add duplicate elements, then remove the duplication

In [19]:
s2 = pd.Series({14: 'first', 15: 'third'})
s = s.append(s2)
s

/var/folders/hf/vxdj7wlj7sngj7ksr0vws3vc0000gn/T/ipykernel_50143/2228438034.py:2: FutureWarning: The series.append method is deprecated and will be removed from pandas in a future version. Use pandas.concat instead.
  s = s.append(s2)

11    first
12      sec
13    third
14    first
15    third
14    first
15    third
dtype: object

In [25]:
s.drop_duplicates()

11    first
12      sec
13    third
dtype: object

## Q5: Create a Students DataFrame has three columns (ID, Name)

In [27]:
 data = {'ID': [111, 112, 113, 114, 115, 116],
        'Name': ['Njood', 'Nora', 'Sara', 'Rema', 'Yara', 'Mariam'],}

Students = pd.DataFrame(data, columns=['ID', 'Name'])
Students

    ID    Name
0  111   Njood
1  112    Nora
2  113    Sara
3  114    Rema
4  115    Yara
5  116  Mariam

## Q6: Read educ_figdp_1_Data.csv file

In [28]:
edu = pd.read_csv('/Users/ghadah/desktop/labs_/Day7-Lab1-Pandas/educ_figdp_1_Data.csv')
edu

,TIME,GEO,INDIC_ED,Value,Flag and Footnotes
0,2000,European Union (28 countries),Total public expenditure on education as % of ...,:,NaN
1,2001,European Union (28 countries),Total public expenditure on education as % of ...,:,NaN
2,2002,European Union (28 countries),Total public expenditure on education as % of ...,5.00,e
3,2003,European Union (28 countries),Total public expenditure on education as % of ...,5.03,e
4,2004,European Union (28 countries),Total public expenditure on education as % of ...,4.95,e
...,...,...,...,...,...
379,2007,Finland,Total public expenditure on education as % of ...,5.90,NaN
380,2008,Finland,Total public expenditure on education as % of ...,6.10,NaN
381,2009,Finland,Total public expenditure on education as % of ...,6.81,NaN
382,2010,Finland,Total public expenditure on education as % of ...,6.85,NaN
383,2011,Finland,Total public expenditure on education as % of ...,6.76,NaN

## Q7: What is the difference between loc and slicing?
- loc use the index labels as references
- slice use the position as references

In [38]:
edu[['TIME','Value']]

     TIME Value
0    2000     :
1    2001     :
2    2002  5.00
3    2003  5.03
4    2004  4.95
..    ...   ...
379  2007  5.90
380  2008  6.10
381  2009  6.81
382  2010  6.85
383  2011  6.76

[384 rows x 2 columns]

In [32]:
edu.loc[80:94,['TIME', 'GEO','Value']]

    TIME                       GEO Value
80  2008  Euro area (13 countries)  4.94
81  2009  Euro area (13 countries)  5.32
82  2010  Euro area (13 countries)  5.28
83  2011  Euro area (13 countries)  5.15
84  2000                   Belgium     :
85  2001                   Belgium  5.99
86  2002                   Belgium  6.09
87  2003                   Belgium  6.02
88  2004                   Belgium  5.95
89  2005                   Belgium  5.92
90  2006                   Belgium  5.98
91  2007                   Belgium  6.00
92  2008                   Belgium  6.43
93  2009                   Belgium  6.57
94  2010                   Belgium  6.58

In [39]:
edu[80:94]

,TIME,GEO,INDIC_ED,Value,Flag and Footnotes
80,2008,Euro area (13 countries),Total public expenditure on education as % of ...,4.94,e
81,2009,Euro area (13 countries),Total public expenditure on education as % of ...,5.32,e
82,2010,Euro area (13 countries),Total public expenditure on education as % of ...,5.28,e
83,2011,Euro area (13 countries),Total public expenditure on education as % of ...,5.15,e
84,2000,Belgium,Total public expenditure on education as % of ...,:,u
85,2001,Belgium,Total public expenditure on education as % of ...,5.99,i
86,2002,Belgium,Total public expenditure on education as % of ...,6.09,d
87,2003,Belgium,Total public expenditure on education as % of ...,6.02,d
88,2004,Belgium,Total public expenditure on education as % of ...,5.95,d
89,2005,Belgium,Total public expenditure on education as % of ...,5.92,d
90,2006,Belgium,Total public expenditure on education as % of ...,5.98,d
91,2007,Belgium,Total public expenditure on education as % of ...,6.00,d
92,2008,Belgium,Total public expenditure on education as % of ...,6.43,d
93,2009,Belgium,Total public expenditure on education as % of ...,6.57,d